var characters = [
    {
        id: 1,
        name: "Старый Маг Тельбран",
        type: "character",
        locationId: 5,
        description: "Бывший архивариус Гильдии Арканов, отстранённый за исследования запретных текстов о Бездне. Теперь живёт как отшельник-книгочей",
        center: [738, 315] // Абсолютные координаты центра
    },
    {
        id: 2,
        name: "Верховный Инквизитор Каррик",
        type: "character",
        locationId: 8,
        description: "Глава Ордена Алого Рассвета, фанатичный и беспринципный служитель Этериуса",
        center: [725, 400] // Абсолютные координаты центра
    },
    {
        id: 3,
        name: "Ярл Ульфрик Скай-Айс",
        type: "character",
        locationId: 9,
        description: "Военный лидер (херсир) клана Снежного Медведя, представитель Хаймрока в Солнцеграде",
        center: [540, 160] // Абсолютные координаты центра
    }, {
        id: 4,
        name: "Сторож на Площади Ясного Неба",
        type: "character",
        locationId: 10,
        description: "Проведёт героев через опасные зоны за плату. Также может дать информацию о безопасных маршрутах.",
        center: [980, 400] // Абсолютные координаты центра
    }, {
        id: 5,
        name: "Барни",
        type: "character",
        locationId: 1,
        description: "Владелец таверны «Пьяный Единорог»",
        center: [866, 495] // Абсолютные координаты центра
    }, {
        id: 6,
        name: "Торгрен",
        type: "character",
        locationId: 2,
        description: "владелец оружейной «Сталь и Верность»",
        center: [400, 265] // Абсолютные координаты центра
    }, {
        id: 7,
        name: "Старая Элоди",
        type: "character",
        locationId: 3,
        description: "владелица аптеки «Корни и Сны».",
        center: [425, 340] // Абсолютные координаты центра
    }, {
        id: 8,
        name: "Мадам Изабель",
        type: "character",
        locationId: 4,
        description: "владелица гостиницы «Позолоченный Единорог»",
        center: [1150, 180] // Абсолютные координаты центра
    },

    {
        id: 9,
        name: "Аколит Элвин",
        type: "character",
        locationId: 5,
        description: "Аколит Золотого Молота",
        center: [653, 255] // Абсолютные координаты центра
    },

    {
        id: 10,
        name: "Верховная жрица Алания",
        type: "character",
        locationId: 6,
        description: "верховная жрица небольшого святилища Сильваны в Солнцеграде",
        center: [1230, 260] // Абсолютные координаты центра
    }, {
        id: 11,
        name: "Жрец Элдервин",
        type: "character",
        locationId: 6,
        description: "Жрец Рощи Тихих Шёпотов",
        center: [1111, 285] // Абсолютные координаты центра
    },
    {
        id: 12,
        name: "Жрец Талос",
        type: "character",
        locationId: 7,
        description: "Верховный жрец храма Морвана в Солнцеграде",
       center: [206, 440] // Абсолютные координаты центра
    },
    {
        id: 13,
        name: "Жрец Элдар",
        type: "character",
        locationId: 7,
        description: "Жрец Гавань Вечного Прилива",
        center: [352, 412] // Абсолютные координаты центра
    },  {
        id: 14,
        name: "Сестра Алисия",
        type: "character",
        locationId: 7,
        description: "Молодая, идеалистичная жрица Этериуса в скромных белых одеяниях. Верит в добро и справедливость",
        center: [636, 340] // Абсолютные координаты центра
    },
];

// Экспортируем для использования в других файлах
if (typeof module !== 'undefined' && module.exports) {
    // Для Node.js
    module.exports = characters;
} else {
    // Для браузера - добавляем в глобальную область видимости
    window.characters = characters;
}